Q1. List any five functions of the pandas library with execution.


Answer(Q1):

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv("https://raw.githubusercontent.com/PriyaPocs/PWPythonAssignments/main/country_code.csv")
print(df)

                  Name Code
0          Afghanistan   AF
1        Åland Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
..                 ...  ...
244  Wallis and Futuna   WF
245     Western Sahara   EH
246              Yemen   YE
247             Zambia   ZM
248           Zimbabwe   ZW

[249 rows x 2 columns]

In [5]:
df.shape

(249, 2)

In [6]:
df.describe()

               Name Code
count           249  246
unique          249  246
top     Afghanistan   AF
freq              1    1

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 249 entries, 0 to 248
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    249 non-null    object
 1   Code    246 non-null    object
dtypes: object(2)
memory usage: 4.0+ KB

In [8]:
df.isna().any

<bound method NDFrame._add_numeric_operations.<locals>.any of       Name   Code
0    False  False
1    False  False
2    False  False
3    False  False
4    False  False
..     ...    ...
244  False  False
245  False  False
246  False  False
247  False  False
248  False  False

[249 rows x 2 columns]>

In [9]:
df.isnull().sum()

Name    0
Code    3
dtype: int64

In [10]:
df.columns

Index(['Name', 'Code'], dtype='object')

Q2. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

Answer(Q2):

In [18]:
# import numpy and pandas module
import pandas as pd

column=['A','B','C']
index=[1,2,3,4,5]

# create a dataframe of random values of array
df1 = pd.DataFrame(columns=column,index=index)

print(df1)

print('\n\nDataframe after reindexing rows: \n')
df1.reindex(list(range(1,10,2)))

     A    B    C
1  NaN  NaN  NaN
2  NaN  NaN  NaN
3  NaN  NaN  NaN
4  NaN  NaN  NaN
5  NaN  NaN  NaN


Dataframe after reindexing rows:

     A    B    C
1  NaN  NaN  NaN
3  NaN  NaN  NaN
5  NaN  NaN  NaN
7  NaN  NaN  NaN
9  NaN  NaN  NaN

Q3. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that iterates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.

For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should calculate and print the sum of the first three values, which is 60.

Answer(Q3):

In [23]:
import pandas as pd

list1 = [10, 20, 30, 40, 50]
column = "Values"
df1 = pd.DataFrame(list1)
df1.columns = ["Values"]
df1

Values    150
dtype: int64

In [36]:
sum1 = df1[0:3].sum()
print("the sum of the first three values \n")
print(sum1)

the sum of the first three values

Values    60
dtype: int64

Q4. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.


Answer(Q4):

In [44]:
import pandas as pd

given_text = "Python is my favourite programming language"
df1 = pd.DataFrame([given_text])
df1.columns = ['Text']
df1
df1['totalwords'] = df1['Text'].str.count(' ') + 1
df1

                                          Text  totalwords
0  Python is my favourite programming language           6

Q5. How are DataFrame.size() and DataFrame.shape() different?

Answer(Q5):

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/PriyaPocs/PWPythonAssignments/main/country_code.csv")
print(df)

                  Name Code
0          Afghanistan   AF
1        Åland Islands   AX
2              Albania   AL
3              Algeria   DZ
4       American Samoa   AS
..                 ...  ...
244  Wallis and Futuna   WF
245     Western Sahara   EH
246              Yemen   YE
247             Zambia   ZM
248           Zimbabwe   ZW

[249 rows x 2 columns]

In [7]:
# Returns size of dataframe/series which is equivalent to total number of elements. That is rows x columns.
size = df.size
  
# printing size 
print("Size = ",size)

# Returns tuple of shape (Rows, columns) of dataframe/series
shape = df.shape
print("shape = ",shape)

Size =  498
shape =  (249, 2)

Q6. Which function of pandas do we use to read an excel file?

Answer(Q6):

read_excel('filename.xlsx') function of pandas is used to read an excel file.

In [ ]:

# import pandas as pd
# pd.read_excel('filename.xlsx')

# print(df)

Q7. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in the format 'username@domain.com'. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address.

The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

Answer(Q7):

In [6]:
import pandas as pd

email_list = ['john.doe@example.com','cooper@abc.com','james@gmail.com','michiel@spark.com']

df1 = pd.DataFrame(email_list)
df1.columns = ['Email']
df1['Username'] = df1['Email'].str.split('@').str[0]
df1

                  Email  Username
0  john.doe@example.com  john.doe
1        cooper@abc.com    cooper
2       james@gmail.com     james
3     michiel@spark.com   michiel

Q8. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.

For example, if df contains the following values:
 ABC

0351
 1827
 2694
 3235
 4912
 
 Your function should select the following rows: 
 A B C

1827

4912

The function should return a new DataFrame that contains only the selected rows.

Answer(Q8):

In [14]:
import pandas as pd

values_list = [[3,5,1],[8,2,7],[6,9,4],[2,3,5],[9,1,2]]

df1 = pd.DataFrame(values_list)
df1.columns = ['A','B','C']
# df1
df2 = df1[(df1['A'] > 5 ) & (df1['B'] < 10 )]
df2

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

Q9. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

Answer(Q9):

In [15]:
import pandas as pd

list1 = [10, 20, 30, 40, 50]
df1 = pd.DataFrame(list1)
df1.columns = ["Values"]
df1.describe()

          Values
count   5.000000
mean   30.000000
std    15.811388
min    10.000000
25%    20.000000
50%    30.000000
75%    40.000000
max    50.000000

Q10. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

Answer(Q10):

In [8]:
import pandas as pd

list1 = [[10,"2023-06-22" ],[20,"2023-06-23" ],[30,"2023-06-24"], [40,"2023-06-25"], [50,"2023-06-26"],[5 ,"2023-06-27"], [100,"2023-06-28"],
        [15,"2023-06-29" ],[20,"2023-06-30" ],[35,"2023-07-01"], [10,"2023-07-02"], [55,"2023-07-03"],[5 ,"2023-07-04"], [25,"2023-07-05"]]
df1 = pd.DataFrame(list1)
df1.columns = ["Sales","Date"]

df1['MovingAverage'] = df1['Sales'].rolling(window=7).mean()
df1

    Sales        Date  MovingAverage
0      10  2023-06-22            NaN
1      20  2023-06-23            NaN
2      30  2023-06-24            NaN
3      40  2023-06-25            NaN
4      50  2023-06-26            NaN
5       5  2023-06-27            NaN
6     100  2023-06-28      36.428571
7      15  2023-06-29      37.142857
8      20  2023-06-30      37.142857
9      35  2023-07-01      37.857143
10     10  2023-07-02      33.571429
11     55  2023-07-03      34.285714
12      5  2023-07-04      34.285714
13     25  2023-07-05      23.571429

Q11. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.

For example, if df contains the following values:
 Date

0 2023-01-01
 1 2023-01-02
 2 2023-01-03
 3 2023-01-04
 4 2023-01-05
 Your function
Date
0 2023-01-01
should create the following DataFrame:


Weekday
 Sunday
 Monday
 Tuesday
 Wednesday
 Thursday

1 2023-01-02
2 2023-01-03
3 2023-01-04
4 2023-01-05
The function should return the modified DataFrame.

Answer(11):

In [11]:
import pandas as pd

dates = pd.date_range(start='2023-01-01', end='2023-01-07')
df = pd.DataFrame({'date': dates})
df['Weekday'] = df['date'].dt.dayofweek

df['Weekday'] = df['Weekday'].map({
    0: 'Monday',
    1: 'Tuesday',
    2: 'Wednesday',
    3: 'Thursday',
    4: 'Friday',
    5: 'Saturday',
    6: 'Sunday'
})

print(df.head())

        date    Weekday
0 2023-01-01     Sunday
1 2023-01-02     Monday
2 2023-01-03    Tuesday
3 2023-01-04  Wednesday
4 2023-01-05   Thursday

Q12. Given a Pandas DataFrame df with a column 'Date' that contains timestamps, write a Python function to select all rows where the date is between '2023-01-01' and '2023-01-31'.

Answer(Q12):

In [16]:
import pandas as pd

dates = pd.date_range(start='2022-12-01  07:30:00', end='2023-05-31  09:00:00')
df = pd.DataFrame({'Date': dates})
df

                   Date
0   2022-12-01 07:30:00
1   2022-12-02 07:30:00
2   2022-12-03 07:30:00
3   2022-12-04 07:30:00
4   2022-12-05 07:30:00
..                  ...
177 2023-05-27 07:30:00
178 2023-05-28 07:30:00
179 2023-05-29 07:30:00
180 2023-05-30 07:30:00
181 2023-05-31 07:30:00

[182 rows x 1 columns]

In [17]:
df[(df['Date'] >= '2023-01-01') & (df['Date'] <= '2023-01-31')]

                  Date
31 2023-01-01 07:30:00
32 2023-01-02 07:30:00
33 2023-01-03 07:30:00
34 2023-01-04 07:30:00
35 2023-01-05 07:30:00
36 2023-01-06 07:30:00
37 2023-01-07 07:30:00
38 2023-01-08 07:30:00
39 2023-01-09 07:30:00
40 2023-01-10 07:30:00
41 2023-01-11 07:30:00
42 2023-01-12 07:30:00
43 2023-01-13 07:30:00
44 2023-01-14 07:30:00
45 2023-01-15 07:30:00
46 2023-01-16 07:30:00
47 2023-01-17 07:30:00
48 2023-01-18 07:30:00
49 2023-01-19 07:30:00
50 2023-01-20 07:30:00
51 2023-01-21 07:30:00
52 2023-01-22 07:30:00
53 2023-01-23 07:30:00
54 2023-01-24 07:30:00
55 2023-01-25 07:30:00
56 2023-01-26 07:30:00
57 2023-01-27 07:30:00
58 2023-01-28 07:30:00
59 2023-01-29 07:30:00
60 2023-01-30 07:30:00

Q13. To use the basic functions of pandas, what is the first and foremost necessary library that needs to be imported?

Answer(Q13):

pandas and numpy libraries

import pandas as pd
import numpy as np

Pandas module runs on top of NumPy and it is popularly used for data science and data analytics.